/********************************** (C) COPYRIGHT *******************************
 * File Name          : sss_i2c_hwsl_lib_v1.h
 * Author             : vantr
 * Version            : V1.1.0
 * Date               : 2026/08/25
 * Description        : Библиотека аппаратного ведомого для шины I2C
 *********************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе.
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_I2CHWSL__
// -----------------------------------------------------------------------------
#define __SSS_I2CHWSL__
// -----------------------------------------------------------------------------
#include "app_config.h"
// ----------------------------------------------------------------------------
#define I2C_WRITE 0
#define I2C_READ 1
// -----------------------------------------------------------------------------
// Команда чтения/установки адреса
#define I2C_SLAVE_ADDR32    0xFF
#define I2C_Slave_READ      0x00
// -----------------------------------------------------------------------------
// Инициализация механизма I2C Slave
void i2c_slave_Init(uint16_t address, uint32_t bus_speed);
// -----------------------------------------------------------------------------
// 🌟 СВЕРХВАЖНОЕ API: Привязка любой переменной или структуры к I2C шине
void I2C_Slave_Link_Data (void *data_ptr, uint16_t data_size);
// -----------------------------------------------------------------------------
// Накопленный 32-битный адрес, принятый от мастера или UINT32_MAX
uint32_t I2C_Slave_READ_ADDR();
// -----------------------------------------------------------------------------
// Накопленный 32-битный адрес, принятый от мастера был завершен?
uint32_t I2C_Slave_READ_ADDR_IsComplete();
// -----------------------------------------------------------------------------
#ifdef I2C_SLAVE_LOG_ENABLED
uint8_t log_getSize();
uint8_t log_getItem (uint8_t index);
void log_reset();
#endif
// -----------------------------------------------------------------------------
#endif